12/data/attachments/5e14143df84549ea.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:updateUserRequest>
            <nif:user>
                <nif:id>765da122-8491-433b-8551-fb7efbfcb42a</nif:id>
                <nif:username>soap_user_b8f2a154-9c62-4a48-98b6-2a5c6d481774</nif:username>
                <nif:currency>KZT</nif:currency>
                
                
                
                
                &lt;nif:fullName&gt;{ Barbara Torres }&lt;/nif:fullName&gt;
                
            </nif:user>
        </nif:updateUserRequest>
    </soapenv:Body>
</soapenv:Envelope>